vanvught/GD32F407RE-DMX512-RDM/lib-ws28xx/src/gd32/gpio/ws28xxmulti.cpp
	DEBUG_EXIT
}

WS28xxMulti::~WS28xxMulti() {
	DEBUG_ENTRY

	s_pThis = nullptr;

	DEBUG_EXIT
}

void WS28xxMulti::Setup(uint8_t nLowCode, uint8_t nHighCode) {
	DEBUG_ENTRY

	/**
	 * BEGIN Timer's
	 *
	 * Timer 2 is Master -> TIMER2_TRGO
	 * Timer 3 is Slave -> ITI2
	 *
	 */

	const auto nT0H = (__builtin_popcount(nLowCode) * (pixel::RTZ_TIMER_PERIOD + 1)) / 8;
	const auto nT1H = (__builtin_popcount(nHighCode) * (pixel::RTZ_TIMER_PERIOD + 1)) / 8;

	DEBUG_PRINTF("RTZ_TIMER_PERIOD=%u, nT0H=%u, nT1H=%u", pixel::RTZ_TIMER_PERIOD, nT0H, nT1H);

	timer_parameter_struct timer_initpara;

	/**
	 * Timer 2 Master
	 * There is no DMA Channel for Timer 2 Channel 1
	 */

	rcu_periph_clock_enable(RCU_TIMER2);

	timer_deinit(TIMER2);

	timer_initpara.prescaler = 0;
	timer_initpara.alignedmode = TIMER_COUNTER_EDGE;
	timer_initpara.counterdirection = TIMER_COUNTER_UP;
	timer_initpara.period = pixel::RTZ_TIMER_PERIOD;	// 1.25 us
	timer_initpara.clockdivision = TIMER_CKDIV_DIV1;

	timer_init(TIMER2, &timer_initpara);

	timer_master_slave_mode_config(TIMER2, TIMER_MASTER_SLAVE_MODE_DISABLE);
	timer_master_output_trigger_source_select(TIMER2, TIMER_TRI_OUT_SRC_CH0);

	timer_channel_output_mode_config(TIMER2, TIMER_CH_0, TIMER_OC_MODE_ACTIVE);
	timer_channel_output_mode_config(TIMER2, TIMER_CH_2, TIMER_OC_MODE_ACTIVE);
	timer_channel_output_mode_config(TIMER2, TIMER_CH_3, TIMER_OC_MODE_ACTIVE);

	timer_channel_output_pulse_value_config(TIMER2, TIMER_CH_0, 1);		// High
	assert(nT0H < UINT16_MAX);
	timer_channel_output_pulse_value_config(TIMER2, TIMER_CH_2, static_cast<uint16_t>(nT0H));
	assert(nT1H < UINT16_MAX);
	timer_channel_output_pulse_value_config(TIMER2, TIMER_CH_3, static_cast<uint16_t>(nT1H));

	// Timer 3 Slave

	rcu_periph_clock_enable(RCU_TIMER3);

	timer_deinit(TIMER3);

	timer_initpara.prescaler = 0;
	timer_initpara.alignedmode = TIMER_COUNTER_EDGE;
	timer_initpara.counterdirection = TIMER_COUNTER_UP;
	timer_initpara.period = static_cast<uint32_t>(~0);
	timer_initpara.clockdivision = TIMER_CKDIV_DIV1;

	timer_init(TIMER3, &timer_initpara);

	timer_master_slave_mode_config(TIMER3, TIMER_MASTER_SLAVE_MODE_DISABLE);
	timer_slave_mode_select(TIMER3, TIMER_SLAVE_MODE_EXTERNAL0);
	timer_input_trigger_source_select(TIMER3, TIMER_SMCFG_TRGSEL_ITI2);

	timer_channel_output_mode_config(TIMER3, TIMER_CH_0, TIMER_OC_MODE_ACTIVE);
	assert((1 + m_nBufSize) < UINT16_MAX);
	timer_channel_output_pulse_value_config(TIMER3, TIMER_CH_0, static_cast<uint16_t>(1 + m_nBufSize));

	timer_interrupt_enable(TIMER3, TIMER_INT_CH0);

	NVIC_SetPriority(TIMER3_IRQn, 0);
	NVIC_EnableIRQ(TIMER3_IRQn);

	/**
	 * END Timer's
	 */

	/**
	 * START DMA configuration
	 */

	DMA_PARAMETER_STRUCT dma_init_struct;
	rcu_periph_clock_enable(TIMER2_RCU_DMAx);

	// Timer 2 Channel 0
	dma_deinit(TIMER2_DMAx, TIMER2_CH0_DMA_CHx);
	dma_struct_para_init(&dma_init_struct);
	dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
#if !defined (GD32F4XX)
	dma_init_struct.memory_addr = reinterpret_cast<uint32_t>(pixel::s_pGPIO_PINs);
#else
	dma_init_struct.memory0_addr = reinterpret_cast<uint32_t>(pixel::s_pGPIO_PINs);
#endif
	dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_DISABLE;
#if !defined (GD32F4XX)
	dma_init_struct.memory_width = DMA_MEMORY_WIDTH_16BIT;
#endif
	dma_init_struct.periph_addr = GPIOx + GPIOx_BOP_OFFSET;
	dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
#if !defined (GD32F4XX)
	dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_16BIT;
#else
	dma_init_struct.periph_memory_width = DMA_PERIPH_WIDTH_16BIT;
#endif
	dma_init_struct.priority = DMA_PRIORITY_LOW;
	dma_init(TIMER2_DMAx, TIMER2_CH0_DMA_CHx, &dma_init_struct);
	dma_circulation_disable(TIMER2_DMAx, TIMER2_CH0_DMA_CHx);
	dma_memory_to_memory_disable(TIMER2_DMAx, TIMER2_CH0_DMA_CHx);
#if defined (GD32F4XX)
	dma_channel_subperipheral_select(TIMER2_DMAx, TIMER2_CH0_DMA_CHx, TIMER2_CH0_DMA_SUBPERIx);
#endif

	// Timer 2 Channel 2
	dma_deinit(TIMER2_DMAx, TIMER2_CH2_DMA_CHx);
	dma_struct_para_init(&dma_init_struct);
	dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
#if !defined (GD32F4XX)
	dma_init_struct.memory_addr = reinterpret_cast<uint32_t>(pixel::s_pT0H);
#else
	dma_init_struct.memory0_addr = reinterpret_cast<uint32_t>(pixel::s_pT0H);
#endif
	dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
#if !defined (GD32F4XX)
	dma_init_struct.memory_width = DMA_MEMORY_WIDTH_16BIT;
#endif
	dma_init_struct.periph_addr = GPIOx + GPIOx_BC_OFFSET;
	dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
#if !defined (GD32F4XX)
	dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_16BIT;
#else
	dma_init_struct.periph_memory_width = DMA_PERIPH_WIDTH_16BIT;
#endif
	dma_init_struct.priority = DMA_PRIORITY_LOW;
	dma_init(TIMER2_DMAx, TIMER2_CH2_DMA_CHx, &dma_init_struct);
	dma_circulation_disable(TIMER2_DMAx, TIMER2_CH2_DMA_CHx);
	dma_memory_to_memory_disable(TIMER2_DMAx, TIMER2_CH2_DMA_CHx);
#if defined (GD32F4XX)
	dma_channel_subperipheral_select(TIMER2_DMAx, TIMER2_CH2_DMA_CHx, TIMER2_CH2_DMA_SUBPERIx);
#endif

	// Timer 2 Channel 3
	dma_deinit(TIMER2_DMAx, TIMER2_CH3_DMA_CHx);
	dma_struct_para_init(&dma_init_struct);
	dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
#if !defined (GD32F4XX)
	dma_init_struct.memory_addr = reinterpret_cast<uint32_t>(pixel::s_pGPIO_PINs);
#else
	dma_init_struct.memory0_addr = reinterpret_cast<uint32_t>(pixel::s_pGPIO_PINs);
#endif
	dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_DISABLE;
#if !defined (GD32F4XX)
	dma_init_struct.memory_width = DMA_MEMORY_WIDTH_16BIT;
#endif
	dma_init_struct.periph_addr = GPIOx + GPIOx_BC_OFFSET;
	dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
#if !defined (GD32F4XX)
	dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_16BIT;
#else
	dma_init_struct.periph_memory_width = DMA_PERIPH_WIDTH_16BIT;
#endif
	dma_init_struct.priority = DMA_PRIORITY_LOW;
	dma_init(TIMER2_DMAx, TIMER2_CH3_DMA_CHx, &dma_init_struct);
	dma_circulation_disable(TIMER2_DMAx, TIMER2_CH3_DMA_CHx);
	dma_memory_to_memory_disable(TIMER2_DMAx, TIMER2_CH3_DMA_CHx);
#if defined (GD32F4XX)
	dma_channel_subperipheral_select(TIMER2_DMAx, TIMER2_CH3_DMA_CHx, TIMER2_CH3_DMA_SUBPERIx);
#endif

	/**
	 * END DMA configuration
	 */

